---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.EnergyModelType.AnalysisMode
enum: Autodesk.Revit.DB.Analysis.EnergyModelType
source: html/18bdee57-3fa2-b6cd-0dea-24ff66a5f97e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyModelType.AnalysisMode

Energy model based on analysis mode in EnergyDataSettings.